<a href="https://colab.research.google.com/github/ganesh077/Colab_Notebooks/blob/main/SQL_Session_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Introduction to SQL
## What is SQL

1.   SQL stands for Structured Query Language.
2.   It is used to communicate with databases.
3.   SQL is used for querying, updating, and managing data.

#Coding Setup
## Database Engine- SQLite3
## Database Name - dummy_database
## Tables -

1.   employees (employee_id, first_name, last_name, age, department_id)
2.   departments (department_id, department_name)
3.   sales (sale_id, employee_id, amount, sale_date)

## How to run queries? -


```
query = '''your query'''
pprint(query,conn)
```

In [12]:
import sqlite3

# Create a connection to the SQLite database
conn = sqlite3.connect('dummy_database.db')
cursor = conn.cursor()

# Execute multiple SQL statements to create tables and insert data
cursor.executescript('''
    DROP TABLE IF EXISTS employees;
    DROP TABLE IF EXISTS departments;
    DROP TABLE IF EXISTS sales;

    CREATE TABLE employees (
        employee_id INTEGER PRIMARY KEY,
        first_name TEXT NOT NULL,
        last_name TEXT NOT NULL,
        age INTEGER,
        department_id INTEGER,
        FOREIGN KEY (department_id) REFERENCES departments(department_id)
    );

    CREATE TABLE departments (
        department_id INTEGER PRIMARY KEY,
        department_name TEXT NOT NULL
    );

    CREATE TABLE sales (
        sale_id INTEGER PRIMARY KEY,
        employee_id INTEGER,
        amount REAL,
        sale_date TEXT,
        FOREIGN KEY(employee_id) REFERENCES employees(employee_id)
    );

    INSERT INTO employees (first_name, last_name, age, department_id)
    VALUES
    ('Ganesh', 'Doe', 30, 1),
    ('Jane', 'Smith', 25, 2),
    ('Emily', 'Johnson', 35, 1),
    ('Michael', 'Brown', 40, 3),
    ('Ash', 'Ketchup', 40, 4);

    INSERT INTO departments (department_name)
    VALUES
    ('HR'),
    ('Engineering'),
    ('Sales');

    INSERT INTO sales (employee_id, amount, sale_date)
    VALUES
    (1, 500.0, '2023-01-01'),
    (2, 1500.0, '2023-01-03'),
    (1, 700.0, '2023-01-05'),
    (3, 1200.0, '2023-01-07');
''')

# Commit changes
conn.commit()

print("Dummy database created successfully!")

import pandas as pd
from tabulate import tabulate

def pprint(query,conn):
    dframe = pd.read_sql_query(query,conn)
    print(tabulate(dframe, headers='keys', tablefmt='fancy_grid', showindex=False))

Dummy database created successfully!

In [13]:
query = '''select * from departments'''
print("Departments:")
pprint(query,conn)
query = '''select * from employees'''
print("Employees:")
pprint(query,conn)
print("Sales:")
query = '''select * from sales'''
pprint(query,conn)

Departments:
╒═════════════════╤═══════════════════╕
│   department_id │ department_name   │
╞═════════════════╪═══════════════════╡
│               1 │ HR                │
├─────────────────┼───────────────────┤
│               2 │ Engineering       │
├─────────────────┼───────────────────┤
│               3 │ Sales             │
╘═════════════════╧═══════════════════╛
Employees:
╒═══════════════╤══════════════╤═════════════╤═══════╤═════════════════╕
│   employee_id │ first_name   │ last_name   │   age │   department_id │
╞═══════════════╪══════════════╪═════════════╪═══════╪═════════════════╡
│             1 │ Ganesh       │ Doe         │    30 │               1 │
├───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│             2 │ Jane         │ Smith       │    25 │               2 │
├───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│             3 │ Emily        │ Johnson     │    35 │               1 │
├───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│             4 │ Michael      │ Brown       │    40 │               3 │
├───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│             5 │ Ash          │ Ketchup     │    40 │               4 │
╘═══════════════╧══════════════╧═════════════╧═══════╧═════════════════╛
Sales:
╒═══════════╤═══════════════╤══════════╤═════════════╕
│   sale_id │   employee_id │   amount │ sale_date   │
╞═══════════╪═══════════════╪══════════╪═════════════╡
│         1 │             1 │      500 │ 2023-01-01  │
├───────────┼───────────────┼──────────┼─────────────┤
│         2 │             2 │     1500 │ 2023-01-03  │
├───────────┼───────────────┼──────────┼─────────────┤
│         3 │             1 │      700 │ 2023-01-05  │
├───────────┼───────────────┼──────────┼─────────────┤
│         4 │             3 │     1200 │ 2023-01-07  │
╘═══════════╧═══════════════╧══════════╧═════════════╛

# Basic SQL Commands

## SELECT and FROM

**SELECT**: Used to select data from a database.
*   Syntax: SELECT column1, column2, ... FROM table_name;
*   Example:


```
SELECT first_name, last_name FROM employees;
```
**FROM**: Specifies the table from which to retrieve the data.

In [14]:
query = '''
SELECT first_name, last_name FROM employees
'''
pprint(query,conn)

╒══════════════╤═════════════╕
│ first_name   │ last_name   │
╞══════════════╪═════════════╡
│ Ganesh       │ Doe         │
├──────────────┼─────────────┤
│ Jane         │ Smith       │
├──────────────┼─────────────┤
│ Emily        │ Johnson     │
├──────────────┼─────────────┤
│ Michael      │ Brown       │
├──────────────┼─────────────┤
│ Ash          │ Ketchup     │
╘══════════════╧═════════════╛

In [15]:
# Activity - 1
# Write a simple query to select sale_id, amount columns from a sales table.

query = '''
SELECT * from sales
'''
pprint(query,conn)

╒═══════════╤═══════════════╤══════════╤═════════════╕
│   sale_id │   employee_id │   amount │ sale_date   │
╞═══════════╪═══════════════╪══════════╪═════════════╡
│         1 │             1 │      500 │ 2023-01-01  │
├───────────┼───────────────┼──────────┼─────────────┤
│         2 │             2 │     1500 │ 2023-01-03  │
├───────────┼───────────────┼──────────┼─────────────┤
│         3 │             1 │      700 │ 2023-01-05  │
├───────────┼───────────────┼──────────┼─────────────┤
│         4 │             3 │     1200 │ 2023-01-07  │
╘═══════════╧═══════════════╧══════════╧═════════════╛

## WHERE

**WHERE**: Filters records.
*   Syntax: SELECT column1, column2, ... FROM table_name WHERE condition;
*   Example:


```
SELECT * FROM employees WHERE age > 30;
```

In [16]:
query = '''
SELECT * FROM employees WHERE age > 30;
'''
pprint(query,conn)

╒═══════════════╤══════════════╤═════════════╤═══════╤═════════════════╕
│   employee_id │ first_name   │ last_name   │   age │   department_id │
╞═══════════════╪══════════════╪═════════════╪═══════╪═════════════════╡
│             3 │ Emily        │ Johnson     │    35 │               1 │
├───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│             4 │ Michael      │ Brown       │    40 │               3 │
├───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│             5 │ Ash          │ Ketchup     │    40 │               4 │
╘═══════════════╧══════════════╧═════════════╧═══════╧═════════════════╛

In [17]:
# Activity 2 -
# Write a query to filter data where department_name = 'HR' from the departments table.


query = '''
SELECT * FROM departments WHERE department_name = 'HR';
'''
pprint(query,conn)

╒═════════════════╤═══════════════════╕
│   department_id │ department_name   │
╞═════════════════╪═══════════════════╡
│               1 │ HR                │
╘═════════════════╧═══════════════════╛

## GROUP BY and HAVING

**GROUP BY**: Groups rows that have the same values.
*   Syntax: SELECT column1, COUNT(*) FROM table_name GROUP BY column1;
*   Example:

```
SELECT department_id, COUNT(*) FROM employees GROUP BY department_id;
```
**Having**: Filters groups.
*   Syntax: SELECT column1, COUNT(\*) FROM table_name GROUP BY column1 having COUNT(\*) > 5;
*   Example:

```
SELECT department_id, COUNT(*) FROM employees GROUP BY department HAVING COUNT(*) > 1;
```

In [18]:
query = '''
SELECT department_id, COUNT(*) FROM employees GROUP BY department_id HAVING COUNT(*) > 1;
'''
pprint(query,conn)
# query = '''
# SELECT department_id, avg(*) FROM employees GROUP BY department_id
# '''
# pprint(query,conn)

╒═════════════════╤════════════╕
│   department_id │   COUNT(*) │
╞═════════════════╪════════════╡
│               1 │          2 │
╘═════════════════╧════════════╛

In [19]:
# Activity - 3
# Write a query to group employees and filter groups by employees who made more than 1 sale in sales table.

query = '''
SELECT * from sales;
'''
pprint(query,conn)


query = '''
SELECT employee_id , COUNT(*) FROM sales GROUP BY employee_id  HAVING COUNT(*) > 1;
'''
pprint(query,conn)

╒═══════════╤═══════════════╤══════════╤═════════════╕
│   sale_id │   employee_id │   amount │ sale_date   │
╞═══════════╪═══════════════╪══════════╪═════════════╡
│         1 │             1 │      500 │ 2023-01-01  │
├───────────┼───────────────┼──────────┼─────────────┤
│         2 │             2 │     1500 │ 2023-01-03  │
├───────────┼───────────────┼──────────┼─────────────┤
│         3 │             1 │      700 │ 2023-01-05  │
├───────────┼───────────────┼──────────┼─────────────┤
│         4 │             3 │     1200 │ 2023-01-07  │
╘═══════════╧═══════════════╧══════════╧═════════════╛
╒═══════════════╤════════════╕
│   employee_id │   COUNT(*) │
╞═══════════════╪════════════╡
│             1 │          2 │
╘═══════════════╧════════════╛

## JOINS

**INNER JOIN**: Returns records with matching values in both tables.
*   SELECT columns FROM table1 INNER JOIN table2 ON table1.column = table2.column;
*   Example:

```
SELECT employees.first_name, departments.department_name
FROM employees
INNER JOIN departments ON employees.department_id = departments.department_id;
```
**LEFT JOIN**: Returns all records from the left table and matched records from the right table.

*   SELECT columns FROM table1 LEFT JOIN table2 ON table1.column = table2.column;
*   Example:

```
SELECT employees.first_name, departments.department_name
FROM employees
INNER JOIN departments ON employees.department_id = departments.department_id;
```

In [20]:
query = '''
SELECT d.first_name, e.department_name
FROM departments e
left JOIN employees d ON e.department_id = d.department_id;
'''
pprint(query,conn)

╒══════════════╤═══════════════════╕
│ first_name   │ department_name   │
╞══════════════╪═══════════════════╡
│ Emily        │ HR                │
├──────────────┼───────────────────┤
│ Ganesh       │ HR                │
├──────────────┼───────────────────┤
│ Jane         │ Engineering       │
├──────────────┼───────────────────┤
│ Michael      │ Sales             │
╘══════════════╧═══════════════════╛

In [21]:
# Activity - 4
# Write a query to join sales table and employees table.

query = '''
SELECT *
FROM sales s
JOIN employees e ON s.employee_id = e.employee_id;
'''
pprint(query,conn)

╒═══════════╤═══════════════╤══════════╤═════════════╤═══════════════╤══════════════╤═════════════╤═══════╤═════════════════╕
│   sale_id │   employee_id │   amount │ sale_date   │   employee_id │ first_name   │ last_name   │   age │   department_id │
╞═══════════╪═══════════════╪══════════╪═════════════╪═══════════════╪══════════════╪═════════════╪═══════╪═════════════════╡
│         1 │             1 │      500 │ 2023-01-01  │             1 │ Ganesh       │ Doe         │    30 │               1 │
├───────────┼───────────────┼──────────┼─────────────┼───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│         2 │             2 │     1500 │ 2023-01-03  │             2 │ Jane         │ Smith       │    25 │               2 │
├───────────┼───────────────┼──────────┼─────────────┼───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│         3 │             1 │      700 │ 2023-01-05  │             1 │ Ganesh       │ Doe         │    30 │               1 │
├───────────┼───────────────┼──────────┼─────────────┼───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│         4 │             3 │     1200 │ 2023-01-07  │             3 │ Emily        │ Johnson     │    35 │               1 │
╘═══════════╧═══════════════╧══════════╧═════════════╧═══════════════╧══════════════╧═════════════╧═══════╧═════════════════╛

## ORDER BY

**ORDER BY**: Allows you to sort the results of a query based on one or more columns.
*   SELECT column1, column2, ...
FROM table_name
WHERE condition
ORDER BY column1, column2, ...;
*   Example:

```
SELECT * FROM employees
ORDER BY age;
```
**ORDER BY DESC**: Sorts the results of a query based on one or more columns in descending order.

*   SELECT column1, column2, ...
FROM table_name
WHERE condition
ORDER BY column1 desc, column2 desc, ...;
*   Example:

```
SELECT * FROM employees
ORDER BY age desc;
```

In [22]:
query = '''
SELECT * FROM employees
ORDER BY age,employee_id;
'''
pprint(query,conn)

╒═══════════════╤══════════════╤═════════════╤═══════╤═════════════════╕
│   employee_id │ first_name   │ last_name   │   age │   department_id │
╞═══════════════╪══════════════╪═════════════╪═══════╪═════════════════╡
│             2 │ Jane         │ Smith       │    25 │               2 │
├───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│             1 │ Ganesh       │ Doe         │    30 │               1 │
├───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│             3 │ Emily        │ Johnson     │    35 │               1 │
├───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│             4 │ Michael      │ Brown       │    40 │               3 │
├───────────────┼──────────────┼─────────────┼───────┼─────────────────┤
│             5 │ Ash          │ Ketchup     │    40 │               4 │
╘═══════════════╧══════════════╧═════════════╧═══════╧═════════════════╛

In [23]:
# Activity - 4
# Write a query to order by sales date in sales table.

query = '''
SELECT * FROM sales
ORDER BY sale_date  desc;
'''
pprint(query,conn)

╒═══════════╤═══════════════╤══════════╤═════════════╕
│   sale_id │   employee_id │   amount │ sale_date   │
╞═══════════╪═══════════════╪══════════╪═════════════╡
│         4 │             3 │     1200 │ 2023-01-07  │
├───────────┼───────────────┼──────────┼─────────────┤
│         3 │             1 │      700 │ 2023-01-05  │
├───────────┼───────────────┼──────────┼─────────────┤
│         2 │             2 │     1500 │ 2023-01-03  │
├───────────┼───────────────┼──────────┼─────────────┤
│         1 │             1 │      500 │ 2023-01-01  │
╘═══════════╧═══════════════╧══════════╧═════════════╛

# Recap and QnA!




*   Doubts and Clarification
*   Next Session - Aggregation (sum,count,min,max..etc)

# Homework

## Tables -

1.   books (book_id, title, author_id, publication_year, genre)
2.   authors (author_id, name)
3.   borrowers (borrower_id, name, membership_date)
4.   loans (loan_id, book_id, borrower_id, loan_date, return_date)

## How to run queries? -


```
query = '''your query'''
pprint(query,conn)
```

In [24]:
cursor.executescript('''
    DROP TABLE IF EXISTS books;
    DROP TABLE IF EXISTS authors;
    DROP TABLE IF EXISTS borrowers;
    DROP TABLE IF EXISTS loans;

    CREATE TABLE books (
        book_id INTEGER PRIMARY KEY,
        title TEXT NOT NULL,
        author_id INTEGER,
        publication_year INTEGER,
        genre TEXT,
        FOREIGN KEY (author_id) REFERENCES authors(author_id)
    );

    CREATE TABLE authors (
        author_id INTEGER PRIMARY KEY,
        name TEXT NOT NULL
    );

    CREATE TABLE borrowers (
        borrower_id INTEGER PRIMARY KEY,
        name TEXT NOT NULL,
        membership_date TEXT
    );

    CREATE TABLE loans (
        loan_id INTEGER PRIMARY KEY,
        book_id INTEGER,
        borrower_id INTEGER,
        loan_date TEXT,
        return_date TEXT,
        FOREIGN KEY(book_id) REFERENCES books(book_id),
        FOREIGN KEY(borrower_id) REFERENCES borrowers(borrower_id)
    );

    INSERT INTO authors (name)
    VALUES
    ('George Orwell'),
    ('J.K. Rowling'),
    ('J.R.R. Tolkien');

    INSERT INTO books (title, author_id, publication_year, genre)
    VALUES
    ('1984', 1, 1949, 'Dystopian'),
    ('Animal Farm', 1, 1945, 'Political Satire'),
    ('Harry Potter and the Sorcerers Stone', 2, 1997, 'Fantasy'),
    ('The Hobbit', 3, 1937, 'Fantasy');

    INSERT INTO borrowers (name, membership_date)
    VALUES
    ('Alice Smith', '2022-01-15'),
    ('Bob Johnson', '2021-06-22'),
    ('Carol White', '2023-02-10');

    INSERT INTO loans (book_id, borrower_id, loan_date, return_date)
    VALUES
    (1, 1, '2024-07-01', '2024-07-15'),
    (3, 2, '2024-07-05', '2024-07-20'),
    (4, 3, '2024-07-10', NULL);
''')

# Commit changes
conn.commit()

print("Library database created successfully!")

Library database created successfully!

#Questions

In [25]:
#1. Write a SQL query to select all columns from the books table.

In [26]:
#2. Write a SQL query to select the title and genre columns from the books table.

In [27]:
#3. Write a SQL query to select all books where the genre is "Fantasy".

In [28]:
#4. Write a SQL query to select all loans where the loan_date is in July 2024.

In [29]:
#5. Write a SQL query to join the books and authors tables on author_id and select the title and name of the authors.

In [30]:
#6. Write a SQL query to select all books and sort them by publication_year in descending order.

In [31]:
#7. Write a SQL query to count the number of loans for each book.